[
    {
        "id": 3,
        "title": "Design Masterclass",
        "skills": [
            "ReactJS",
            "SASS",
            "Django",
            "Python",
            "Stripe"
        ],
        "url": {
            "frontend": "https://github.com/martytrajkoski/designmasterclass-frontend",
            "backend": "https://github.com/martytrajkoski/designmasterclass-backend",
            "design": "https://www.figma.com/design/XMkUlEHg320lYCERbfP4ch/DesignMasterclass?t=xCnk72n43EnvXx4Q-1"
        },
        "content": "Individual project for an educational web application for graphic designers using Adobe platforms (Illustrator and Photoshop). The application goal is to describe the capabilities of both platforms using quizzes, free and paid courses or simple explanations for all offered tools. This project was part of a college course that I worked on independently. To realize this project I used Figma for mockup design, Python's Django Framework, ReactJS on front-end, Axios HTTP client."
    },
    {
        "id": 4,
        "title": "Motion",
        "skills": [
            "InertiaReact",
            "SASS",
            "Laravel-PHP"
        ],
        "url": {
            "frontend": "https://github.com/martytrajkoski/Motion"
        },
        "content": "Motion is a versatile Note and Reminder app designed to help users stay organized and on top of their tasks. After creating an account, users can easily add, edit, and delete notes on a dedicated notes page, ensuring that important information is always at their fingertips. The app also features a reminder page where users can add, edit, and delete reminders. Each reminder can be assigned a priority level, helping users prioritize tasks based on their importance. A key feature of Motion is the ability to share reminders with other users, making it easier to collaborate and keep track of shared tasks. With a focus on simplicity and functionality, Motion provides a streamlined experience for managing personal notes and reminders, all while ensuring users can efficiently organize their tasks."
    },
    {
        "id": 5,
        "title": "Orange Melons",
        "skills": [
            "ReactJS",
            "SASS",
            "Laravel-PHP",
            "MySQL"
        ],
        "url": {
            "frontend": "https://github.com/bah-melon/om-practice",
            "backend": "https://github.com/bah-melon/om-backend",
            "design": "https://www.figma.com/design/g8M1ptbrUZ1S0xQO8ErFo0/Orange-Melons?t=xCnk72n43EnvXx4Q-1"
        },
        "content": "OrangeMelons is a website designed for an IT company, offering a seamless job application process for applicants and robust management tools for administrators. Applicants can browse available positions and apply by filling in the required information and uploading their CVs directly through the website. The platform also includes a dedicated admin section, where administrators can manage job listings and applications. Admins have the ability to add new job openings, edit or delete existing ones, and review all submitted applications. They can also filter applications by specific job roles, read and download applicants' CVs, or remove them as needed. This project was created as part of my own practice to improve my skills in developing a comprehensive platform. It balances user experience with administrative functionality, streamlining the job application process for both applicants and company administrators."
    },
    {
        "id": 6,
        "title": "Chat App",
        "skills": [
            "React TypeScript",
            "SASS",
            "Laravel-PHP",
            "MySQL"
        ],
        "url": {
            "frontend": "https://github.com/martytrajkoski/ChatApp-frontend",
            "backend": "https://github.com/martytrajkoski/ChatApp-backend",
            "design": "https://www.figma.com/design/TK148LphO7dSN7TUbzNmNY/Chat-Application?node-id=0-1&t=xCnk72n43EnvXx4Q-1"
        },
        "content": "The Chat Application is a dynamic platform that allows users to create accounts and communicate effortlessly. Users can send and delete text messages, with notifications for when messages are read, fostering transparency in conversations. The messaging keyboard includes a variety of emojis, adding a creative touch to interactions. A convenient search function enables users to quickly find and initiate chats, making it easy to connect with friends and colleagues. Leveraging broadcasting capabilities, the app ensures real-time communication for instant message transfers. Built with React and TypeScript for a responsive frontend, and Laravel PHP for the backend, this project showcases my skills in full-stack development and my ability to create engaging, user-friendly applications that enhance communication experiences."
    },
    {
        "id": 7,
        "title": "inSys",
        "skills": [
            "React TypeScript",
            "SASS",
            "Laravel-PHP",
            "MySQL"
        ],
        "url": {
            "frontend": "https://github.com/martytrajkoski/inSys--frontend",
            "backend": "https://github.com/bojananananan/inSys--backend/tree/project"
        },
        "content": "This project is a digital system for managing university invoices. It allows users to upload real-life invoice PDFs and process them through three defined roles within the university workflow. Once completed, the Prodean reviews the invoice, with options to accept, reject, or send back with feedback. Approved invoices are sealed and securely archived. The system also includes a searchable archive where all invoices are stored and can be filtered by specific parameters, ensuring efficient tracking and management."
    },
    {
        "id": 8,
        "title": "Ohrid Apartments",
        "skills": [
            "React TypeScript",
            "SASS",
            "Laravel-PHP",
            "MySQL",
            "AWS + Netlify",
            "Go Daddy"
        ],
        "url": {
            "frontend": "https://github.com/martytrajkoski/OhridApartments",
            "backend": "https://github.com/martytrajkoski/ohrid-apartments-backend",
            "deployed": "https://theohridapartments.com/"
        },
        "content": "A web application showcasing different villas in Ohrid, where users can explore available apartments, check detailed information, view locations, and make reservations directly through the platform. The system provides an intuitive interface for browsing listings, ensuring a seamless booking experience for visitors."
    }
]